benchmark_results/NVIDIA_GeForce_RTX_4090/vLLM_NVIDIA_GeForce_RTX_4090_gpt_oss_20b_text_only_20260203_153914.txt
##############################################################
# vLLM TEXT-ONLY BENCHMARK RESULTS
##############################################################

DEVICE INFO
-----------
Device (raw):       NVIDIA GeForce RTX 4090
Device (sanitized): NVIDIA_GeForce_RTX_4090
NVIDIA GeForce RTX 4090, 24564 MiB, 590.48.01, 8.9

METADATA
--------
Date:            Tue Feb  3 03:39:14 PM AEST 2026
Hostname:        daniel-dl-pc
Model:           openai/gpt-oss-20b
Test Type:       Text-Only
Thinking Mode:   Default
Num Prompts:     100
Max Concurrency: 10
Num Warmups:     10
Input Length:    1000 (±0.3)
Output Length:   300 (±0.3)
Seed:            42

##############################################################
# TEST RESULTS
##############################################################

============================================================
TEST: Text-Only Benchmark
Started: Tue Feb  3 03:39:14 PM AEST 2026
============================================================

Script started on 2026-02-03 15:39:14+10:00 [COMMAND="bash /tmp/tmp.O9aa7arTig" TERM="xterm-256color" TTY="/dev/pts/2" COLUMNS="170" LINES="16"]

==========
== vLLM ==
==========

NVIDIA Release 25.12.post1 (build 247811355)
vLLM Version 0.12.0+35a9f223
Container image Copyright (c) 2025, NVIDIA CORPORATION & AFFILIATES. All rights reserved.

Various files include modifications (c) NVIDIA CORPORATION & AFFILIATES.  All rights reserved.

GOVERNING TERMS: The software and materials are governed by the NVIDIA Software License Agreement
(found at https://www.nvidia.com/en-us/agreements/enterprise-software/nvidia-software-license-agreement/)
and the Product-Specific Terms for NVIDIA AI Products
(found at https://www.nvidia.com/en-us/agreements/enterprise-software/product-specific-terms-for-ai-products/).

WARNING: The NVIDIA Driver was not detected.  GPU functionality will not be available.
   Use the NVIDIA Container Toolkit to start this container with GPU support; see
   https://docs.nvidia.com/datacenter/cloud-native/ .

NOTE: The SHMEM allocation limit is set to the default of 64MB.  This may be
   insufficient for vLLM.  NVIDIA recommends the use of the following flags:
   docker run --gpus all --ipc=host --ulimit memlock=-1 --ulimit stack=67108864 ...

/usr/local/lib/python3.12/dist-packages/torchvision/io/image.py:14: UserWarning: Failed to load image Python extension: 'Could not load this library: /usr/local/lib/python3.12/dist-packages/torchvision/image.so'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
INFO 02-03 05:39:16 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 02-03 05:39:16 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 02-03 05:39:16 [interface.py:221] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
INFO 02-03 05:39:17 [main.py:47] Unspecified platform detected, switching to CPU Platform instead.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x716eadaa3060>, seed=42, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1000, random_output_len=300, random_range_ratio=0.3, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=10, model='openai/gpt-oss-20b', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=10, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-d19a6a98-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600, extra_body=None)
tokenizer_config.json: 0.00B [00:00, ?B/s]tokenizer_config.json: 4.20kB [00:00, 10.1MB/s]
tokenizer.json:   0%|                                                                                                                         | 0.00/27.9M [00:00<?, ?B/s]tokenizer.json: 100%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 27.9M/27.9M [00:01<00:00, 23.3MB/s]tokenizer.json: 100%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 27.9M/27.9M [00:01<00:00, 23.3MB/s]
special_tokens_map.json:   0%|                                                                                                                 | 0.00/98.0 [00:00<?, ?B/s]special_tokens_map.json: 100%|██████████████████████████████████████████████████████████████████████████████████████████████████████████| 98.0/98.0 [00:00<00:00, 426kB/s]
chat_template.jinja: 0.00B [00:00, ?B/s]chat_template.jinja: 16.7kB [00:00, 31.6MB/s]
INFO 02-03 05:39:21 [datasets.py:613] Sampling input_len from [700, 1300] and output_len from [210, 390]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |                                                                                                                                            | 00:00 elapsed, ? remaining |                                                                                                                                        | 00:00 elapsed, 00:08 remaining |                                                                                                                                    | 00:00 elapsed, 343:46:25 remaining
Initial test run completed.
Warming up with 10 requests...
  0%|                                                                                                                                              | 0/10 [00:00<?, ?it/s] 10%|█████████████▍                                                                                                                        | 1/10 [00:00<00:07,  1.15it/s] 70%|█████████████████████████████████████████████████████████████████████████████████████████████▊                                        | 7/10 [00:00<00:00,  9.11it/s]100%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 10/10 [00:01<00:00,  9.38it/s]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 10
  0%|                                                                                                                                             | 0/100 [00:00<?, ?it/s]  1%|█▎                                                                                                                                   | 1/100 [00:01<02:37,  1.59s/it]  2%|██▋                                                                                                                                  | 2/100 [00:01<01:10,  1.40it/s]  5%|██████▋                                                                                                                              | 5/100 [00:01<00:21,  4.40it/s]  7%|█████████▎                                                                                                                           | 7/100 [00:01<00:14,  6.37it/s]  9%|███████████▉                                                                                                                         | 9/100 [00:02<00:16,  5.55it/s] 11%|██████████████▌                                                                                                                     | 11/100 [00:03<00:26,  3.41it/s] 12%|███████████████▊                                                                                                                    | 12/100 [00:03<00:22,  3.84it/s] 13%|█████████████████▏                                                                                                                  | 13/100 [00:03<00:20,  4.28it/s] 15%|███████████████████▊                                                                                                                | 15/100 [00:03<00:14,  5.99it/s] 17%|██████████████████████▍                                                                                                             | 17/100 [00:03<00:12,  6.86it/s] 19%|█████████████████████████                                                                                                           | 19/100 [00:04<00:11,  6.77it/s] 20%|██████████████████████████▍                                                                                                         | 20/100 [00:04<00:17,  4.49it/s] 21%|███████████████████████████▋                                                                                                        | 21/100 [00:05<00:18,  4.22it/s] 22%|█████████████████████████████                                                                                                       | 22/100 [00:05<00:20,  3.89it/s] 25%|█████████████████████████████████                                                                                                   | 25/100 [00:05<00:11,  6.68it/s] 27%|███████████████████████████████████▋                                                                                                | 27/100 [00:05<00:10,  6.77it/s] 28%|████████████████████████████████████▉                                                                                               | 28/100 [00:06<00:11,  6.04it/s] 29%|██████████████████████████████████████▎                                                                                             | 29/100 [00:06<00:14,  4.90it/s] 30%|███████████████████████████████████████▌                                                                                            | 30/100 [00:06<00:15,  4.57it/s] 32%|██████████████████████████████████████████▏                                                                                         | 32/100 [00:06<00:11,  5.86it/s] 33%|███████████████████████████████████████████▌                                                                                        | 33/100 [00:07<00:10,  6.26it/s] 34%|████████████████████████████████████████████▉                                                                                       | 34/100 [00:07<00:10,  6.26it/s] 36%|███████████████████████████████████████████████▌                                                                                    | 36/100 [00:07<00:13,  4.75it/s] 37%|████████████████████████████████████████████████▊                                                                                   | 37/100 [00:07<00:11,  5.29it/s] 38%|██████████████████████████████████████████████████▏                                                                                 | 38/100 [00:08<00:11,  5.53it/s] 39%|███████████████████████████████████████████████████▍                                                                                | 39/100 [00:08<00:13,  4.58it/s] 41%|██████████████████████████████████████████████████████                                                                              | 41/100 [00:08<00:09,  6.15it/s] 43%|████████████████████████████████████████████████████████▊                                                                           | 43/100 [00:08<00:08,  6.50it/s] 44%|██████████████████████████████████████████████████████████                                                                          | 44/100 [00:09<00:10,  5.12it/s] 45%|███████████████████████████████████████████████████████████▍                                                                        | 45/100 [00:09<00:11,  4.76it/s] 46%|████████████████████████████████████████████████████████████▋                                                                       | 46/100 [00:09<00:14,  3.83it/s] 47%|██████████████████████████████████████████████████████████████                                                                      | 47/100 [00:09<00:12,  4.29it/s] 49%|████████████████████████████████████████████████████████████████▋                                                                   | 49/100 [00:10<00:08,  5.91it/s] 50%|██████████████████████████████████████████████████████████████████                                                                  | 50/100 [00:10<00:09,  5.02it/s] 51%|███████████████████████████████████████████████████████████████████▎                                                                | 51/100 [00:10<00:08,  5.48it/s] 52%|████████████████████████████████████████████████████████████████████▋                                                               | 52/100 [00:10<00:11,  4.14it/s] 53%|█████████████████████████████████████████████████████████████████████▉                                                              | 53/100 [00:11<00:10,  4.63it/s] 55%|████████████████████████████████████████████████████████████████████████▌                                                           | 55/100 [00:11<00:07,  5.89it/s] 56%|█████████████████████████████████████████████████████████████████████████▉                                                          | 56/100 [00:11<00:08,  5.34it/s] 59%|█████████████████████████████████████████████████████████████████████████████▉                                                      | 59/100 [00:12<00:07,  5.69it/s] 60%|███████████████████████████████████████████████████████████████████████████████▏                                                    | 60/100 [00:12<00:07,  5.18it/s] 61%|████████████████████████████████████████████████████████████████████████████████▌                                                   | 61/100 [00:12<00:08,  4.70it/s] 62%|█████████████████████████████████████████████████████████████████████████████████▊                                                  | 62/100 [00:12<00:07,  5.07it/s] 63%|███████████████████████████████████████████████████████████████████████████████████▏                                                | 63/100 [00:12<00:06,  5.75it/s] 64%|████████████████████████████████████████████████████████████████████████████████████▍                                               | 64/100 [00:12<00:05,  6.21it/s] 65%|█████████████████████████████████████████████████████████████████████████████████████▊                                              | 65/100 [00:13<00:07,  4.83it/s] 66%|███████████████████████████████████████████████████████████████████████████████████████                                             | 66/100 [00:13<00:06,  4.88it/s] 67%|████████████████████████████████████████████████████████████████████████████████████████▍                                           | 67/100 [00:13<00:05,  5.59it/s] 68%|█████████████████████████████████████████████████████████████████████████████████████████▊                                          | 68/100 [00:13<00:06,  5.09it/s] 69%|███████████████████████████████████████████████████████████████████████████████████████████                                         | 69/100 [00:13<00:05,  5.86it/s] 70%|████████████████████████████████████████████████████████████████████████████████████████████▍                                       | 70/100 [00:14<00:05,  5.86it/s] 72%|███████████████████████████████████████████████████████████████████████████████████████████████                                     | 72/100 [00:14<00:04,  5.67it/s] 73%|████████████████████████████████████████████████████████████████████████████████████████████████▎                                   | 73/100 [00:14<00:04,  6.10it/s] 74%|█████████████████████████████████████████████████████████████████████████████████████████████████▋                                  | 74/100 [00:14<00:05,  5.08it/s] 76%|████████████████████████████████████████████████████████████████████████████████████████████████████▎                               | 76/100 [00:15<00:04,  5.61it/s] 77%|█████████████████████████████████████████████████████████████████████████████████████████████████████▋                              | 77/100 [00:15<00:05,  4.59it/s] 78%|██████████████████████████████████████████████████████████████████████████████████████████████████████▉                             | 78/100 [00:15<00:04,  4.76it/s] 80%|█████████████████████████████████████████████████████████████████████████████████████████████████████████▌                          | 80/100 [00:16<00:04,  4.74it/s] 81%|██████████████████████████████████████████████████████████████████████████████████████████████████████████▉                         | 81/100 [00:16<00:04,  4.46it/s] 83%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████▌                      | 83/100 [00:16<00:02,  6.02it/s] 84%|██████████████████████████████████████████████████████████████████████████████████████████████████████████████▉                     | 84/100 [00:16<00:03,  5.03it/s] 85%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████▏                   | 85/100 [00:17<00:02,  5.60it/s] 86%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████▌                  | 86/100 [00:17<00:03,  4.12it/s] 87%|██████████████████████████████████████████████████████████████████████████████████████████████████████████████████▊                 | 87/100 [00:17<00:02,  4.45it/s] 88%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▏               | 88/100 [00:17<00:02,  4.58it/s] 89%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▍              | 89/100 [00:17<00:02,  5.26it/s] 90%|██████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▊             | 90/100 [00:18<00:02,  4.40it/s] 92%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▍          | 92/100 [00:18<00:01,  5.80it/s] 94%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████        | 94/100 [00:18<00:00,  7.70it/s] 95%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▍      | 95/100 [00:18<00:00,  6.95it/s] 97%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████    | 97/100 [00:18<00:00,  8.31it/s] 99%|██████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▋ | 99/100 [00:19<00:00, 10.29it/s]100%|███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 100/100 [00:19<00:00,  5.18it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Maximum request concurrency:             10        
Benchmark duration (s):                  19.29     
Total input tokens:                      101603    
Total generated tokens:                  3178      
Request throughput (req/s):              5.18      
Output token throughput (tok/s):         164.77    
Peak output token throughput (tok/s):    584.00    
Peak concurrent requests:                17.00     
Total Token throughput (tok/s):          5432.70   
---------------Time to First Token----------------
Mean TTFT (ms):                          113.54    
Median TTFT (ms):                        80.00     
P99 TTFT (ms):                           495.16    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          59.23     
Median TPOT (ms):                        55.43     
P99 TPOT (ms):                           131.97    
---------------Inter-token Latency----------------
Mean ITL (ms):                           17.95     
Median ITL (ms):                         13.33     
P99 ITL (ms):                            86.85     
==================================================

Script done on 2026-02-03 15:39:43+10:00 [COMMAND_EXIT_CODE="0"]
CSV saved to: ./benchmark_results/NVIDIA_GeForce_RTX_4090/vLLM_NVIDIA_GeForce_RTX_4090_gpt_oss_20b_text_only_samples_100_20260203_153914.csv

Completed: Tue Feb  3 03:39:43 PM AEST 2026


##############################################################
# vLLM TEXT-ONLY BENCHMARK COMPLETE
##############################################################
Results saved to: ./benchmark_results/NVIDIA_GeForce_RTX_4090/vLLM_NVIDIA_GeForce_RTX_4090_gpt_oss_20b_text_only_20260203_153914.txt